Revit 2027 API
DimensionSegment.ResetTextPosition Method
Resets the text position of the segment to the initial position determined by its type and parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetTextPosition()
Public Sub ResetTextPosition
public:
void ResetTextPosition()
member ResetTextPosition : unit -> unit
Remarks
The initial point is the text location when dimension is created.
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace